
-- Додавання фахівців
INSERT INTO clinic.doctors (DoctorID, FirstName, LastName, Specialty, LicenseNumber)
VALUES
    (1, 'Іван', 'Петров', 'Терапевт', '12345'),
    (2, 'Марія', 'Іванова', 'Хірург', '67890'),
    (3, 'Олексій', 'Сидоренко', 'Офтальмолог', '54321'),
    (4, 'Тетяна', 'Коваленко', 'Педіатр', '98765'),
    (5, 'Олена', 'Михайленко', 'Лікувальний масажист', '11111');

-- Додавання пацієнтів
INSERT INTO clinic.patients (PatientID, FirstName, LastName, Address, Phone)
VALUES
    (1, 'Олександр', 'Сидоров', 'вул. Центральна, 123', '123-456-7890'),
    (2, 'Ірина', 'Коваль', 'вул. Перша, 456', '987-654-3210'),
    (3, 'Петро', 'Іванов', 'вул. Друга, 789', '456-789-0123'),
    (4, 'Маргарита', 'Петренко', 'вул. Третя, 987', '789-012-3456'),
    (5, 'Вікторія', 'Олійник', 'вул. Четверта, 654', '321-654-9870');

-- Додавання записів на прийом
INSERT INTO clinic.appointments (AppointmentID, AppointmentDateTime)
VALUES
    (1, '2023-11-30 09:00:00'),
    (2, '2023-12-01 10:30:00'),
    (3, '2023-12-02 11:00:00'),
    (4, '2023-12-03 14:30:00'),
    (5, '2023-12-04 15:45:00');

-- Додавання діагнозів
INSERT INTO clinic.diagnoses (DiagnosisID, Diagnosis, DiagnosisDate)
VALUES
    (1,  'Грип', '2023-11-30'),
    (2,  'Зламана рука', '2023-12-01'),
    (3,  'Односторонній вид', '2023-12-02'),
    (4,  'Захворювання верхніх дихальних шляхів', '2023-12-03'),
    (5,  'Мязова дистрофія', '2023-12-04');

INSERT INTO clinic.doctor_schedules (ScheduleID, DayOfWeek, StartTime, EndTime)
VALUES
    (1,  'Понеділок', '09:00:00', '17:00:00'),
    (2,  'Вівторок', '10:00:00', '18:00:00'),
    (3,  'Середа', '11:00:00', '19:00:00'),
    (4,  'Четвер', '14:00:00', '22:00:00'),
    (5,  'Пятниця', '15:00:00', '23:00:00');


-- Додавання записів на прийом
INSERT INTO clinic.appointment_records (RecordID, RecordDateTime)
VALUES
    (1,  '2023-11-25 15:00:00'),
    (2,  '2023-12-02 11:30:00'),
    (3,  '2023-12-03 10:45:00'),
    (4,  '2023-12-04 13:15:00'),
    (5,  '2023-12-05 14:30:00');

-- Додавання вартості консультацій
INSERT INTO clinic.consultation_cost (CostID, Amount)
VALUES
    (1,  50.00),
    (2,  75.00),
    (3,  60.00),
    (4,  55.00),
    (5,  70.00);

-- Додавання протоколів лікування
INSERT INTO clinic.treatment_protocols (ProtocolID,TreatmentDescription, StartDate, EndDate)
VALUES
    (1, 'Призначено антибіотики', '2023-11-30', '2023-12-07'),
    (2, 'На жаль, потрібна операція', '2023-12-01', '2023-12-10'),
    (3, 'Рекомендації щодо корекції зору', '2023-12-02', '2023-12-09'),
    (4, 'Призначено лікування та відпочинок', '2023-12-03', '2023-12-12'),
    (5, 'Фізіотерапія та спеціальна дієта', '2023-12-04', '2023-12-11');
